"""
Этот скрипт вычисляет теоретическую прецессию перигелия Меркурия,
основываясь на гравитационном влиянии других планет Солнечной системы.
"""
import mpmath as mp
from consts import *

def b31(alpha):
    """Вычисляет коэффициент b31 для расчета прецессии.

    Args:
        alpha (float): Отношение больших полуосей орбиты возмущаемого и возмущающего тел.

    Returns:
        float: Вычисленное значение коэффициента b31.
    """
    m = 4*alpha/(1+alpha)**2
    K = mp.ellipk(m)
    E = mp.ellipe(m)
    return ((1+alpha**2)*E - (1-alpha)**2*K) / (mp.pi*alpha*(1+alpha)*(1-alpha)**2)

a_AU_J2000 = [
    0.38709927,
    0.72333566,
    1.00000261,
    1.52371034,
    5.20288700,
    9.53667594,
    19.18916464,
    30.06992276,
]

m_kg = [
    0.330103e24,
    4.86731e24,
    5.97217e24,
    0.641691e24,
    1898.125e24,
    568.317e24,
    86.8099e24,
    102.4092e24,
]

M_sun_kg = 1.988475e30
e_mercury_J2000 = 0.20563593

w = 0

n = mp.sqrt(G * M_sun_kg / (a_AU_J2000[0] * AU) ** 3)

print(2 * mp.pi / n)

for i in range(1, len(a_AU_J2000)):
    alpha = a_AU_J2000[0] / a_AU_J2000[i]
    w += n / 2 * m_kg[i] / M_sun_kg * alpha ** 2 * b31(alpha) * mp.sqrt(1 - e_mercury_J2000 ** 2)

print(w * 180 / mp.pi * 3600 * 3600 * 24 * 36525)
